remotemcu/remcu-chip-sdks/stm32/stm32f0/STM32F0xx_StdPeriph_Lib_V1.5.0/Libraries/STM32F0xx_CPAL_Driver/inc/stm32f0xx_i2c_cpal.h
typedef enum
{
  CPAL_I2C_ERR_NONE      = 0x00000000, /*!<No Error: This is the default state for an Idle peripheral */

  CPAL_I2C_ERR_TIMEOUT   = 0x000000FF, /*!<Timeout error: The specified timeout has been elapsed without 
                                         any response (expected flag or data didn't happen at expected time).*/

  CPAL_I2C_ERR_BERR      = 0x00000100, /*!<A bus error is detected when a START or a STOP condition is detected
                                           and is not located after a multiple of 9 SCL clock pulses.
                                           The bus error flag is set only in case the I2C is involved in the transfer
                                           as master or addressed slave.
                                           In case of a misplaced START or ReSTART detection, the I2C enters address
                                           recognition state as for a correct START condition.
                                           When a bus error is detected, BERR flag is set in I2C_ISR register, and an
                                           interrupt is generated if ERRIE is set in I2C_CR1 register.*/

  CPAL_I2C_ERR_ARLO      = 0x00000200, /*!<An arbitration loss is detected when a high level is sent on SDA, but a low
                                           level is sampled on the SCL rising edge.
                                            ? In master mode, the arbitration loss is detected during address phase, data
                                              phase and data acknowledge phase. In that case, SDA and SCL lines are released,
                                              START control bit is cleared by hardware and the master switches automatically
                                              to slave mode.
                                            ? In slave mode, arbitration loss is detected during data phase and data acknowledge
                                              phase. In that case, the transmission is stopped, and SCL and SDA lines are released.
                                           When an arbitration loss is detected, ARLO flag is set in I2C_ISR register, and an
                                           interrupt is generated if ERRIE is set in I2C_CR1 register.*/

  CPAL_I2C_ERR_AF        = 0x00000010, /*!<Acknowledge Failure : NACK is considered as error only when this event is set in master mode.
                                            ? If Master: a Stop or repeated Start condition must be generated by software.
                                            When a NACK is detected, NACKF flag is set in I2C_ISR register, and an
                                           interrupt is generated if NACKIE is set in I2C_CR1 register.*/

  CPAL_I2C_ERR_OVR       = 0x00000400, /*!<An overrun or underrun error is detected in slave mode when NOSTRETCH=1 and:
                                            ? In reception when a new byte is received and the RXDR register has not been read yet
                                            New received byte is lost, and a NACK is automatically sent as a response to the new byte.
                                            ? In transmission :
                                              – when STOPF=1 and the first data should be sent. The content of TXDATA is sent.
                                              – when a new byte should be sent and the TXDR register has not been written yet.
                                                The content of TXDATA is sent (same byte is sent twice)
                                           When an overrun or underrun error is detected, OVR flag is set in I2C_ISR register,
                                           and an interrupt is generated if ERRIE is set in I2C_CR1 register.*/

 }CPAL_I2CErrorTypeDef;


/*========= CPAL_Dev_TypeDef =========*/
/* CPAL Device structure definition */

typedef struct 
{
  CPAL_DevTypeDef         CPAL_Dev;          /*!<Instance of the device. This parameter can be one
                                                 of the following values: CPAL_Dev_TypeDef */

  CPAL_DirectionTypeDef   CPAL_Direction;    /*!<Specifies the direction for the device transfers.
                                                 It can be one of the following values: CPAL_Direction_TypeDef */

  CPAL_ModeTypeDef        CPAL_Mode;         /*!<Specifies the maser/slave mode of device. It can be one of the
                                                 following values: CPAL_Mode_TypeDef */

  CPAL_ProgModelTypeDef   CPAL_ProgModel;    /*!<Specifies the programming model for the device transfers.
                                                 It can be one of the following values:  CPAL_ProgModel_Enum */

  CPAL_TransferTypeDef*   pCPAL_TransferTx;  /*!<Pointer on a structure specifying the parameters of the current
                                                 transmission operations. The structure fields are specified as
                                                 follows: CPAL_Transfer_TypeDef. Use pNULL value if this direction
                                                 is not needed.*/

  CPAL_TransferTypeDef*   pCPAL_TransferRx;  /*!<Pointer on a structure specifying the parameters of the current
                                                 reception operations. The structure fields are specified as
                                                 follows: CPAL_Transfer_TypeDef. Use pNULL value if this direction
                                                 is not needed.*/

  __IO CPAL_StateTypeDef  CPAL_State;        /*!<Holds the current State of the CPAL driver relative to the device
                                                 instantiated by CPAL_Dev field. The state parameter can be one of
                                                 the following values: CPAL_State_Enum */

