remotemcu/remcu-chip-sdks/stm32/stm32f0/STM32F0xx_StdPeriph_Lib_V1.5.0/Libraries/STM32F0xx_CPAL_Driver/inc/stm32f0xx_i2c_cpal.h
#ifdef USE_MULTIPLE_ERROR_CALLBACK

  #ifndef CPAL_I2C_BERR_UserCallback
   void  CPAL_I2C_BERR_UserCallback(CPAL_DevTypeDef pDevInstance); /*<!This callback is called when an Bus ERROR
                                                                       occurred on the peripheral while transferring
                                                                       (If I2C Error interrupt is enabled) */
  #endif

  #ifndef CPAL_I2C_ARLO_UserCallback
   void  CPAL_I2C_ARLO_UserCallback(CPAL_DevTypeDef pDevInstance); /*<!This callback is called when an Arbitration Lost
                                                                       ERROR occurred on the peripheral while transferring
                                                                       (If I2C Error interrupt is enabled) */
  #endif

  #ifndef CPAL_I2C_OVR_UserCallback 
   void  CPAL_I2C_OVR_UserCallback(CPAL_DevTypeDef pDevInstance); /*<!This callback is called when an Overrun/Underrun
                                                                      ERROR occurred on the peripheral while transferring
                                                                      (If I2C Error interrupt is enabled) */
  #endif

  #ifndef CPAL_I2C_AF_UserCallback
   void  CPAL_I2C_AF_UserCallback(CPAL_DevTypeDef pDevInstance); /*<!This callback is called when an Not Acknowledge
                                                                     is received (If I2C NACK interrupt is enabled) */
  #endif

#endif /* USE_SINGLE_ERROR_CALLBACK */



#ifdef __cplusplus
}
#endif

#endif /*__STM32F0XX_I2C_CPAL_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
